{
  "_class_name": "Transformer3DModel",
  "_diffusers_version": "0.27.0",
  "activation_fn": "gelu-approximate",
  "attention_bias": true,
  "attention_head_dim": 72,
  "attention_type": "default",
  "basic_block_type": "global_motionmodule",
  "caption_channels": 4096,
  "casual_3d": false,
  "casual_3d_upsampler_index": null,
  "cross_attention_dim": 1152,
  "decay": 0.9999,
  "double_self_attention": false,
  "dropout": 0.0,
  "enable_uvit": true,
  "fake_3d": false,
  "in_channels": 12,
  "inv_gamma": 1.0,
  "min_decay": 0.0,
  "motion_module_kwargs_even": {
    "attention_block_types": [
      "Temporal_Self",
      "Temporal_Self"
    ],
    "block_size": 1,
    "num_attention_heads": 16,
    "num_transformer_block": 1,
    "temporal_attention_dim_div": 1,
    "temporal_position_encoding": true,
    "temporal_position_encoding_max_len": 4096
  },
  "motion_module_kwargs_odd": {
    "attention_block_types": [
      "Temporal_Self",
      "Global_Self"
    ],
    "block_size": 1,
    "num_attention_heads": 16,
    "num_transformer_block": 1,
    "temporal_attention_dim_div": 1,
    "temporal_position_encoding": true,
    "temporal_position_encoding_max_len": 4096
  },
  "motion_module_type": "Vanilla",
  "norm_elementwise_affine": false,
  "norm_eps": 1e-06,
  "norm_num_groups": 32,
  "norm_type": "ada_norm_single",
  "num_attention_heads": 16,
  "num_embeds_ada_norm": 1000,
  "num_layers": 28,
  "num_vector_embeds": null,
  "only_cross_attention": false,
  "optimization_step": 4400,
  "out_channels": 8,
  "patch_3d": false,
  "patch_size": 2,
  "power": 0.6666666666666666,
  "sample_size": 64,
  "time_patch_size": null,
  "time_position_encoding_before_transformer": false,
  "upcast_attention": false,
  "update_after_step": 0,
  "use_ema_warmup": false,
  "use_linear_projection": false
}
