{
  "_class_name": "AutoencoderKL",
  "_diffusers_version": "0.22.0.dev0",
  "act_fn": "silu",

  "down_block_types": [
    "SpatialDownBlock3D", 
    "SpatialTemporalDownBlock3D", 
    "SpatialTemporalDownBlock3D",
    "SpatialTemporalDownBlock3D"
  ],
  "in_channels": 3,
  "latent_channels": 4,
  "layers_per_block": 2,
  "norm_num_groups": 32,
  "out_channels": 3,
  "scaling_factor": 0.18215,
  "slice_compression_vae": true,
  "use_tiling": true,
  "mid_block_attention_type": "3d",
  "mini_batch_encoder": 8,
  "mini_batch_decoder": 2,
  "up_block_types": [
    "SpatialUpBlock3D", 
    "SpatialTemporalUpBlock3D", 
    "SpatialTemporalUpBlock3D",
    "SpatialTemporalUpBlock3D"
  ]
}
